// data/jobs.ts

import { Job } from "types"

// data/jobs.ts

export const JOBS: Job[] = [
  {
    slug: "senior-frontend-engineer",
    title: "Senior Frontend Engineer",
    department: "Engineering",
    description:
      "我们正在寻找一位对人工智能充满热情，并拥有深厚技术功底的高级前端开发工程师。理想的候选人应具备扎实的计算机科学基础，至少5年的前端开发经验，精通React、Vue等现代开发框架及TypeScript，并对深度学习和大模型有基础理解和实践兴趣。我们特别欣赏那些具有跨平台开发经验、熟练使用AI开发工具，并具备出色团队合作精神和自我驱动力的候选人。此外，候选人需要精通海内外项目的开发和管理。加入我们，您将参与前沿的人工智能技术探索之旅，共同推动技术进步。",
    location: "Hangzhou, China",
    responsibilities: [
      "负责前端技术选型及开发工作",
      "通用组件、类库编写，提升开发效率和质量",
      "通过技术手段，提升用户体验并满足高性能要求",
      "具有较强的新技术学习能力，并能将新技术应用到实际项目中",
      "负责团队 AI 相关的前端项目开发",
      "负责团队海外项目的研发",
      "负责团队小程序相关项目的开发",
    ],
    qualifications: [
      "拥有计算机科学或相关专业的本科及以上学历，具备扎实的计算机基础知识，对数据结构、网络等核心概念有深刻理解",
      "至少5年以上（推荐8年以上）的前端开发工作经验，能够展示出丰富的项目实践和成功案例",
      "熟悉前端相关技术栈（HTML、CSS、JavaScript），有扎实的代码功底和良好的上层设计能力",
      "熟悉常见的语言增强技术（TypeScript、Less 或 Sass、TailwindCSS 等）",
      "熟悉常用框架（React、Vue3）的实现原理及开发模式",
      "熟悉常见的小程序开发框架（Uniapp、Taro）等",
      "熟悉 SSR 开发框架（Next.js、Remix.js）等",
      "熟悉常用的 UI 框架（Ant Design）等",
      "熟悉前端工程化相关技术（Webpack、Vite、CI/CD、Docker、Nginx ）等",
      "对前端相关技术抱有好奇心，持续关注前沿技术",
      "具有出色的架构设计和方案设计能力，能够独立负责项目或业务领域，快速识别问题并制定有效的解决方案",
      "具备强烈的自我驱动力和责任感，能够主动深入了解业务需求，并与团队成员进行有效沟通合作",
      "对AI技术有浓厚兴趣和一定的理解，特别是如何将AI元素融合到前端开发中以提升用户体验和产品价值",
      "优秀的团队合作精神和沟通能力，能够在跨职能团队中有效协作，推动项目向前发展",
    ],
    extras: [
      "有做过票务订座类（如大麦网）项目经验优先",
      "有做过 AI 领域的前端项目经验优先",
      "有做过海外 Shopify 电商相关项目经验优先（Remix.js 、Liquid ）等",
    ],
    roadmap: "https://roadmap.sh/r/embed?id=669632182b17b182cb03592d",
  },
]
